app/controllers/practitioners_controller.rb

  def index
    @practitioners = Practitioner.all
---
SELECT "practitioners".* FROM "practitioners"

  def create
    @practitioner = Practitioner.new(practitioner_params)

    respond_to do |format|
      if @practitioner.save
---
INSERT INTO "practitioners" ("first_name", "last_name", "department", "position", "place_of_work", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @practitioner.update(practitioner_params)
---
UPDATE "practitioners" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "practitioners"."id" = ?  [["address", "Manila"], ["latitude", 14.5995124], ["longitude", 120.9842195], ["updated_at", 2016-08-28 16:30:36 UTC], ["id", 2]]

  def destroy
    @practitioner.destroy
---
DELETE FROM "practitioners" WHERE "practitioners"."id" = ?  [["id", 1]]

    def set_practitioner
      @practitioner = Practitioner.find(params[:id])
---
SELECT  "practitioners".* FROM "practitioners" WHERE "practitioners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]